In [1]:
import pandas as pd
import numpy as np

In [2]:
data1 = pd.read_csv("files\\data\\1_food_waste.csv", encoding='cp949')
data2_1 = pd.read_csv("files\\data\\2-1_korean.csv", encoding='cp949')
data2_2 = pd.read_csv("files\\data\\2-2_long_term_frgn.csv", encoding='cp949')
data2_3 = pd.read_csv("files\\data\\2-3_short_term_frgn.csv", encoding='cp949')
data3 = pd.read_csv("files\\data\\3_resident_pop.csv", encoding='cp949')
data4 = pd.read_csv("files\\data\\4_card_spending.csv", encoding='cp949')

In [53]:
data1.head(10)

    base_date city    emd_cd emd_nm em_area_cd  em_cnt   em_g  pay_amt
0  2018-01-01  제주시  50110670    외도동     W6X062       2  15500      464
1  2018-01-01  제주시  50110630    아라동     W6XA97      25  59800     1787
2  2018-01-01  제주시  50110630    아라동     W6XA96       8  25350      758
3  2018-01-01  제주시  50110630    아라동     W6XA95      12  30000      898
4  2018-01-01  제주시  50110630    아라동     W6XA94      14  44050     1317
5  2018-01-01  제주시  50110630    아라동     W6XA93       4  12150      364
6  2018-01-01  제주시  50110660    노형동     W6XA92       1   1000       30
7  2018-01-01  제주시  50110660    노형동     W6XA91      11  26800      801
8  2018-01-01  제주시  50110660    노형동     W6XA90      11  21500      643
9  2018-01-01  제주시  50110630    아라동     W6XA98      29  56300     1681

In [33]:
# 필요없는 열 삭제 (날짜, 행정동코드, 행정동명, 배출량만 남김)
data1_pre = data1.drop(['city', 'em_area_cd', 'em_cnt', 'pay_amt'], 1)
data1_pre

          base_date    emd_cd emd_nm    em_g
0        2018-01-01  50110670    외도동   15500
1        2018-01-01  50110630    아라동   59800
2        2018-01-01  50110630    아라동   25350
3        2018-01-01  50110630    아라동   30000
4        2018-01-01  50110630    아라동   44050
...             ...       ...    ...     ...
2211440  2021-06-30  50110250    한림읍   58250
2211441  2021-06-30  50110250    한림읍  111000
2211442  2021-06-30  50110250    한림읍   48300
2211443  2021-06-30  50110250    한림읍   22050
2211444  2021-06-30  50110640    오라동    2900

[2211445 rows x 4 columns]

In [41]:
# 각 열을 하나의 type으로 통일

# 날짜데이터 datetime으로 변환
data1_pre['base_date'] = pd.to_datetime(data1_pre['base_date'], format="%Y-%m-%d")
# "알수없음" 삭제
idx = data1_pre[data1_pre['emd_cd'] == "알수없음"].index
data1_pre = data1_pre.drop(idx)
# 행정동코드 int형으로 변환
data1_pre['emd_cd'] = pd.to_numeric(data1_pre['emd_cd'])
data1_pre

         base_date    emd_cd emd_nm    em_g
0       2018-01-01  50110670    외도동   15500
1       2018-01-01  50110630    아라동   59800
2       2018-01-01  50110630    아라동   25350
3       2018-01-01  50110630    아라동   30000
4       2018-01-01  50110630    아라동   44050
...            ...       ...    ...     ...
2211440 2021-06-30  50110250    한림읍   58250
2211441 2021-06-30  50110250    한림읍  111000
2211442 2021-06-30  50110250    한림읍   48300
2211443 2021-06-30  50110250    한림읍   22050
2211444 2021-06-30  50110640    오라동    2900

[2209691 rows x 4 columns]

In [54]:
type(data1_pre['em_g'][0])

numpy.int64

In [52]:
# 행정동코드 매개변수로 받아서 해당 구역의 배출량을 월별로 정리
def monthly_output(emdcd):
    emd_data = data1_pre[data1_pre['emd_cd'] == emdcd]    # 해당 행정동 데이터만 추출
    emd_data_monthly = emd_data.resample('M', on='base_date').sum()    # 월별로 합산
    emd_data_monthly = emd_data_monthly.drop(['emd_cd'], 1)    # 행정동코드 삭제
    return emd_data_monthly

monthly_output(50110670)

                 em_g
base_date
2018-01-31   95864700
2018-02-28   88582050
2018-03-31   97356250
2018-04-30   88844750
2018-05-31   94064300
2018-06-30  100357550
2018-07-31  124292900
2018-08-31  115475450
2018-09-30   97489600
2018-10-31   93525200
2018-11-30   94443250
2018-12-31  101745450
2019-01-31   97317450
2019-02-28   93201100
2019-03-31   93075950
2019-04-30   87075650
2019-05-31   92812950
2019-06-30   97149950
2019-07-31  112283300
2019-08-31  107713250
2019-09-30   96168350
2019-10-31   85114050
2019-11-30   86091200
2019-12-31   92350950
2020-01-31   92336746
2020-02-29   94108700
2020-03-31   98399600
2020-04-30   89160650
2020-05-31   98045200
2020-06-30   88248849
2020-07-31  111732950
2020-08-31  110243800
2020-09-30   88884250
2020-10-31   89881050
2020-11-30   88486000
2020-12-31   98028250
2021-01-31   96402550
2021-02-28   84339150
2021-03-31   90926700
2021-04-30   89457350
2021-05-31   97421950
2021-06-30  100096900